{
  "messages": [
    { "message": "Hey Emily! I apologize once again for lying to you...I haven't been spending all my time working on research. Instead, I've been working on this website for your birthday! I hope you'll forgive me for my omissions (and also my lack of UI skills). I wanted to create a website as a medium to express how I feel. I've never been good with words of affirmation, but I know how important they can be. So, this is my attempt. I hope you'll enjoy it :)\nSince today is your birthday, I'll start with happy birthday Emily!! You only turn 23 once and I know you'll have an amazing year ahead of you. Even over the past 2 months, I've seen you grow so much in life. It brings me joy to witness it. Although you're thousands of miles away, you've never felt closer. I missed you when we said goodbye at the Caltrain station, I miss you right now, and I'll continue to miss you however long we're apart. Happy birthday <3\n- David", "timestamp": "2025-10-01T15:00:00Z" },
    { "message": "I still remember when you first DM'd me. I was in Chongqing just vibing with the family when I got this message from this girl named Emily talking about trains. At first, I thought it was just a fun conversation I could have about the city I was currently exploring. However, as time went on, something changed. I noticed it first whenever I'd feel a 'lil jolt of excitement every time I received a notification you'd texted me. My parents would look at my inquisitively every time I'd be smiling while on my phone: I was texting you of course. By the end of my trip in China, I couldn't wait to meet you in person. Truly a 21st century romance. Sometimes, when I'm lying in bed drifting off to sleep, I think about all the things that led to this moment, and how improbable it all was. Any number of little things could've led things to fizzle out, and yet, in every reality, I think we arrive at this same point. Maybe it's lofty thinking, maybe it's fate, idk, all I know is that I'm happy I met you.\n- David", "timestamp": "2025-10-11T15:00:00Z" },
    { "message": "Sometimes, I look back and it dawns on me that we only spent 2 weeks together in person. How crazy is that? It didn't feel like just 2 weeks. It really did feel like a lifetime. I still remember that first day inside of Nana's Green Tea (RIP Coffeeholic). I remember being impressed by your Taiwan adventure, and how gutsy it was to dive head first into a completely new experience. However, I knew there was something there when we started talking about familial culture. It felt so serendipitous that, during a time when I was deep in introspection about my own identity, I could find someone who'd gone through a similar journey of self-discovery. I really enjoy every one of our little debates, and how you challenge me to open my mind. I really like that about you. I really like you.\n- David", "timestamp": "2025-10-18T15:00:00Z" },
    { "message": "", "timestamp": "2025-10-25T15:00:00Z" },
    { "message": "No sneak peaks ahead allowed", "timestamp": "2025-11-01T15:00:00Z" }
  ]
}
